[
  {
    "title": "COMMON",
    "thimbles": [
      {
        "text": "За освоение рубежей дальнего космоса",
        "description": "Любителям Евы и Стеллариса посвящается"
      },
      {
        "text": "За прекрасную Россию будущего",
        "description": "Посвящается либерахам"
      },
      {
        "text": "За дисперсию",
        "description": "Матемаикам, физикам и кастомхиршикам"
      },
      {
        "text": "За то чтобы ласковые ветра чарующих снов давали покой душе и ясность мыслям",
        "description": "Любителям Изеры"
      },
      {
        "text": "За торжество мужского государства",
        "description": "В честь 100% мужского состава БИЧЕХОСТОВ"
      },
      {
        "text": "За превосходство плоти перед бездушными машинами",
        "description": "Памяти разрушеного пальца о косяк кухни"
      },
      {
        "text": "За бичиные технологии, подарившие нам Бичебота и Бичесайт",
        "description": "Жучиные технологии + любовь к программированию"
      },
      {
        "text": "За наше великое аристократическое будущее",
        "description": "Во имя аристократок, запертых в худом теле"
      },
      {
        "text": "Предлагаю тост, за весь состав вооружённых сил некоммерческой гоповоской организации БИЧЕХОСТЫ. За Гуниральской состав, за бравых капитанов, за доблестных офицеров, и конечно же, за наших татарочек",
        "description": "За наше военизированное происхождение"
      },
      {
        "text": "За Клэша и коалицию гопов 22 сессии. За Анклав, за ПЖиВ, за Зергов, за БХшников, за БИЧЕХОСТОВ!",
        "description": "За братсво гопов"
      },
      {
        "text": "За стабилизацию скиллухи Бичехостов и уничтожение антигопов, за то что там ☝️ все схвачено",
        "description": "Единственный тост, который совпал"
      },
      {
        "text": "За долгую счастливую жизнь",
        "description": "За мой ДР"
      },
      {
        "text": "За то, чтобы коробки были твердыми, а бутылки мягкимм",
        "description": "За традиции БИЧЕХОСТОВ"
      },
      {
        "text": "За Бизнесхостов",
        "description": "За наше будущее"
      },
      {
        "text": "За Тиндер, будет он проклят",
        "description": "4 элемент зла"
      },
      {
        "text": "За непрекращающуюся борьбу с энтропией самоуничтожения. За борьбу не лёгкую, но праведную",
        "description": "Против дединсайдства"
      },
      {
        "text": "За период полураспада",
        "description": "...Бичехостов"
      },
      {
        "text": "За то, чтобы в жизни было много пирожков, и ни одного пирожковича",
        "description": "За красоту и чтобы никто не чувствовал голода"
      },
      {
        "text": "За вечнозелёные леса Аншевальского леса",
        "description": "За игры"
      },
      {
        "text": "За парсинг порнхаба",
        "description": "За интересные заказы на фрилансе"
      },
      {
        "text": "Алер есть инфа от знающего человека, что жизнь скоро наладиться. После того, как стабилизируется скилуха бичехостов, уничтожат антигопов (зашкварная в фолаче организация). Тогда везде и попрет, нексус с бичехостами объединятся над общими проектами. Онлаин фолача поднимут и будут держать, Wow пожухнет. \nСейчас главное не бухтеть. \n\nОт нас требуется сидеть тихо. После того, как все сделают, все будет у нас хорошо. Всем устроят довольствие, как гражданам ГУ (как у квира) - каждый будет бегать в топе. Главное сейчас сидеть тихо и не суетиться. Никаких дединсайд постов, никаких батхертов. Просто переждать и всё будет хорошо, там все схвачено.",
        "description": "Фулл версия от Квира"
      }
    ]
  },
  {
    "title": "DISCORD",
    "thimbles": [
      {
        "text":  "Итак завтра знаменательный день! не такой знаменательный как вечер 1945, но тоже неплохой, если вы спросите меня что меня больше всего впечатлило в тот день? это конечно ветераны ВОВ. (кроме магов)  Так вот, великие ужасные БИЧЕХОСТЫ завтра! 1 сентября (МЫ НЕ ШКОЛОТА!) идут на забиф в центр мира (кфц на радищева) что бы в очередной раз обсудить генеральские вопросы и проникнуться великой русской школьной скорбью! НО НЕ ЗАБЫВАЕМ т.к месяц позитива подошел к концу ЭТО НЕ ЗНАЧИТ что мы теперь дединсайды, (как мы с квиром в вове) кста вов топ, я 15000 в очереди гамаю как тварь! и так сбор в 19:00 по ЕКБ как же я люблю тебя Екатеринбург! БИИИЧЕЕЕЕЕЕЕХОООООСТЫЫЫЫЫЫЫ!!!!!!!!!!!!!!!!!!!!!!!!!!:lejatbamboe: :lejatbamboe: :lejatbamboe:  (подтвердите приглашение пивом)",
        "description": "Призыв собраться на Г-9, 1 сентября 2019 года"
      },
      {
        "text":  "Уже считаю дни, когда мы наконец, сядем в квиромобиль и поедем на хату а эклеру :dobrobamboe:  Усьалость такая, что тяжело играть в лол. Игр было в этом месяце дофега но та игра с алером 2на2 с свердловским проверенным мне запомнилась больше всего :oldbamboe:\n:dobrobamboe: может лучше в :supremebamboe:?",
        "description": "21 декабря 2019"
      },
      {
        "text": "Мужики, завтра вайп в 11:00 екб скажите пожелания по важим билдам, я вам накидаю",
        "description": "Фраза, давшая старт истории БИЧЕХОСТОВ, 6 марта 2019"
      },
      {
        "text": "Алер, какое-то отвращение к тебе после  вчерашнего. Всю жизнь в маске дурачка перед нами работягами. Выглядишь очень хитрым, просчитывающим все ходы. Умер тот веселый задрот алер для меня, который бежал за шавухой и чаем нести. Ты все время врал нам, что гречей питаешься. А все ради того чтобы быть ближе к своей аудитории. Давно меня так не обманывали, прощай. \n:igorbamboe2: :igorbamboe2: :igorbamboe2:",
        "description": "Паста, 18 февраля, 2020"
      },
      {
        "text": "как говорится, Бичехостам привет а остальным соболезную\n:newfagbamboe::newfagbamboe::newfagbamboe::oldlejatbamboe::oldigorbamboe::olddobrobamboe::oldbamboe:",
        "description": "19 февраля, 2020"
      },
      {
        "text": "Нет ничего тупее женской фразы: «Ты что, сам выйти в :t3: не можешь?»Да я-то всё могу. :dobrobamboe: Только наxера тогда ты здесь?!\n— У тебя высшее образование есть?\n— Конечно есть: кандидат :t3: наук.\nКогда мужчина создает турниры — это нормально.\nНе нормально — когда он в них играет играет.\n— Дорогой, а ты любишь игры?\n— Конечно, любимая.\n— А какие?\n— :nolifer:-:lifer:. Если у тебя в кошельке :lifer:, то на наших отношениях ставится :nolifer:.",
        "description": "Бичехосты-стервы, 13 декабря 2019"
      },
      {
        "text": "Счастливый мужчина — это когда хотел в :supremebamboe:, а вышел в :t3:. Потом до дома не дошел и улетел :imbabamboe: ...за счёт своей :spongebamboe: конечно :oldbamboe:.",
        "description": "Бичехосты-стервы, 13 декабря 2019"
      },
      {
        "text": "Женщина должна приносить в постель :imbabamboe:.\n:lifer: — это как-то старомодно.\n:dobrobamboe:<(Я бросаю трубку только для того, чтобы ты мне перезвонила. Ухожу, чтобы вернула. Сначала делаю, потом думаю. Говоришь, что любишь меня? Сначала полюби мои принципы.)\n\n:igorbamboe2: <(Я бросаю трубку только для того, чтобы ты мне :dobrobamboe: :ok_hand_tone1:  . Ухожу, чтобы вернула. Сначала делаю, потом :lifer:   Говоришь, что :oroobamboe:   меня? Сначала полюби мои :supremebamboe: )",
        "description": "Бичехосты-стервы, 13 декабря 2019"
      },
      {
        "text": "Ни одна беременная :spongebamboe: не в состоянии выдержать и сотой доли той боли, что выносит мужчина, когда выходит в :t3:",
        "description": "Бичехосты-стервы, 13 декабря 2019"
      },
      {
        "text": "Хм, \"Егор\" вызывает у тебя :hearts:? Понятно...\nХм, \"Хм, \"Егор\" вызывает у тебя :hearts:? Понятно...\" вызывает у тебя slivbamboe? Понятно...\nХм, \"Хм, \"Хм, \"Егор\" вызывает у тебя :hearts:? Понятно...\" вызывает у тебя slivbamboe? Понятно...\" вызывает у тебя :valera:? Понятно...\nХм, \"Хм, \"Хм, \"Хм, \"Егор\" вызывает у тебя :hearts:? Понятно...\" вызывает у тебя slivbamboe? Понятно...\" вызывает у тебя :valera:? Понятно...\" вызывает у тебя :lyabamboe:? Понятно...",
        "description": "Бичебот троллит, 18 декабря 2019"
      },
      {
        "text": "Я сам очень стеснительный человек и признаться кому либо в любви я не могу, сейчас так точно. Я не тот парень который говорит \"мне 12 лет миня бросила девушка я хачу умирте\", я никогда в жизни никого не любил, но она была исключением.",
        "description": "Паста, 24 декабря 2019"
      },
      {
        "text": "Сейчас мне 17 летя и я больше никому не говорю о своих чувствах, а так же я Хикка-задрот, анимешник, имею 6 расстройств личности и делаю суицид ежедневно как минимум 3 раза в день:clown::clown::clown:.",
        "description": "Паста, 24 декабря 2019"
      },
      {
        "text": "Я крайне редко общаюсь с вами, но мне хочется высказаться. Я не знаю как каждый здесь оказался и как ко мне относится, случайно здесь или нет, любит меня или ненавидит. Но я благодарен людям которые ценят меня и то что я делаю. Я вижу каждого и всегда искреннее благодарю вас за приятные слова или банальные лайки",
        "description": "Паста, 1 января 2020"
      },
      {
        "text": "Всём бесконечной любви, что у меня не удалась, желаю не стать мне подобным, желаю построить свою жизнь, и люблю бесконечно тех, кто остались со мной когда у меня начались проблемы, ну вы поймёте сами, я вас люблю:heart::heart::heart:",
        "description": "Паста, 2 января 2020"
      },
      {
        "text": "Как насчет поиграть дуалгеп и снайп корсарами НЫЫААААА:lejatbamboe::lejatbamboe::lejatbamboe::lejatbamboe:",
        "description": "Предложение Бичебота"
      },
      {
        "text": "Сверхчеловек Генри Кавилл признался, что предпочёл бы сейчас сидеть дома в шортах и футболке и играть в supreme commander forged alliance. Он уже наиграл сотни часов и прошёл кампанию за 4 разных рас. В интервью журналу GQ Генри заявил: «Снайпя корсарами я получаю удовольствие. Скоро выходит новое DLC, а я уже жду не дождусь следующего».\nКак думаете, за какую фракцию он наиграл больше всего?",
        "description": "ЗА КЕБРАН! Паста, 4 января 2020"
      },
      {
        "text": "INFERIOR COMMANDER\n\nБИЧЕХОСТОВАЯ\n\nНА ДУАЛ ГЕПЕ КРОВЬ И ПОТ\nС ВОДЫ ТОЛСТЯК КРУШИТЬ ИДЁТ\nИ В ЧИСТОМ ПОЛЕ СНАЙП ИДЕТ\nВСЕХ ЛИБЕРАХ ОН ВМИГ ПОРВЕТ\n\nЭТООООО\nСУПРИИИИМ, УБИИИИЙСТВА-А-А-А\nМЫ ЗДЕСЬ\nТВОРИИИМ, БЕСЧИИИНСТВАА--А-А-А\n\nУ НАС РЕЙТИНГ МЕНЬШЕ ТЫСЧИ\nВСЕХ УБЬЕМ КРОМЕ ПОДПИСЧИЦ\nКРОВАВЫЙ БОГ НЕСС-СКАУТ-МАСТЕР\nПОРВЕТ ТЕБЯ ИТОТИН БЛАСТЕР\n\n\nЭТООООО\nСУПРИИИИМ, УБИИИИЙСТВА-А-А-А\nМЫ ЗДЕСЬ\nТВОРИИИМ, БЕСЧИИИНСТВАА--А-А-А",
        "description": "Песня в стиле Голого кабана, 17 января 2020"
      },
      {
        "text": "Блин, я думаю, что Хост мог бы спокойно вести передачи на кулинарных телеканалах ! Типок реально все классно \"раскидывает\" и даже мне, человеку который особо не любит смотреть монотонные  кулинарные телеканалы, смотреть его реально интересно ! Объясняет все так, что любой может взять и приготовить кулинарный изыск",
        "description": "Паста, 16 февраля 2020"
      },
      {
        "text": "Алер, какое-то отвращение к тебе после  вчерашнего. Всю жизнь в маске дурачка перед нами работягами. Выглядишь очень хитрым, просчитывающим все ходы. Умер тот веселый задрот алер для меня, который бежал за шавухой и чаем нести. Ты все время врал нам, что гречей питаешься. А все ради того чтобы быть ближе к своей аудитории. Давно меня так не обманывали, прощай",
        "description": "Паста, 18 февраля 2020"
      },
      {
        "text": "Развел себя как гуля на нуболоке. Стою под душем, думаю чет надо бы потеплее. Кручу вентиль, становиться лучше, но чуть-чуть. Кручу дальше и стало очень холодно :oroobamboe: . Оказывается я всегда крутил в холодную сторону, просто сказал что стало теплее :vasyanbamboe:",
        "description": "Шутка, которую никто не понял, 26 февраля 2020"
      },
      {
        "text": "Не запил, а ерунда. То ли дело Fonline: Ashes of Phoenix. Там и мапы все новые, не надоевшие и запилы более реальные и интересные. Тут тупо стоят и пуляются, ни укрытий, ни тактики, никакого смысла. Тупое дрочево. Одинаковым оружием стоят на пустой площадке обстреливаются... Тупость.",
        "description": "Паста, 26 февраля 2020"
      },
      {
        "text": "Моя история из FOnline: я зашел спросил у профи что тут делать для быстрого начала он сказал просто уйти иначе сожрёт и я свалил. Не ну а шо вы ожидали",
        "description": "Паста? к собранию по фильму о Фолаче, 26 февраля 2020"
      },
      {
        "text": "Чуваки, я только что понял, что я дединсайд всего полтора года, а раньше я им не был :ohrenelbamboe: \nИ что вообще ноулайферы стали лайферами, а потом бичехостами из-за разрушенных мужских судеб:ohrenelbamboe: :ohrenelbamboe: :ohrenelbamboe:\nЕщё я вспомнил, что мой дом это Гиперхата\nЗА ГИПЕРХАТУ!",
        "description": "Откровения Алера, 23 марта 2020"
      },
      {
        "text": "Если вдруг меня не станет бэйби\nтак наверно, будет даже легче \nтеперь можешь лайкать мои мемы \nрасскажи как мы с алером нагибали в доте",
        "description": ":igorbamboe2:, 15 апреля 2020"
      }
    ]
  },
  {
    "title": "TOP ANIME CROSSOVER",
    "thimbles": [
      {
        "text": "Что ты получишь, если смешаешь БИЧЕХОСТА с обществом, которое игнорирует его и обращается с ним как с мусором? Ты получишь то, что заслужил.",
        "description": ""
      },
      {
        "text": "Я похож на человека, у которого есть план? Я знаешь кто? Я БИЧЕХОСТ играющий в кастомхиро. Я бы не знал, что делать, если б чего-то добился... Так что, я просто играю, и всё.",
        "description": ""
      },
      {
        "text": "У Сени есть планы. У Паши есть планы. Фанта сильно занят. Они все лайферы. Лайферы пытаются контролировать свои тесные мирки. \nЯ не лайфер. Я пытаюсь показать им, насколько жалки их попытки все контролировать. Поэтому когда я говорю, что моюсь раз в три дня, я говорю чистую правду.",
        "description": ""
      },
      {
        "text": "Знаешь откуда у меня эти шрамы? Однажды моя собака взбесилась больше обычного...",
        "description": ""
      },
      {
        "text": "Алер, брат, что ты будешь делать со своей долей?\n―У меня очень простые запросы. Мне нравится гречка, мальборо красный и пиво свердловское проверенное. И знаешь, что между ними общего? Они дёшевы!",
        "description": ""
      },
      {
        "text": "Смотри, что я сделал с БИЧЕХОСТАМИ с помощью дискорда и пары мемов!\nИ знаешь что я заметил?\nНикто не паникует, когда алер бухтит... даже если он окончательно сдедидсайдился.\nЕсли завтра я заявлю прессе, что удаляю лол, если скажу хосту что больше не буду играть с ним в доту — паники не будет. Потому что всё это — уже было. Но когда я говорю, что закрываю БИЧЕХОСТОВ, все вдруг теряют голову!",
        "description": ""
      },
      {
        "text": "―Мой козырь - это Хост.\n―Что ты сделал?\n―Я взял Белого Рыцаря Алохабамбу и внедрил его в гуниралы. Это было просто. Ведь сыграть последнюю каточку, ты же знаешь, это как гравитация - нужно всего лишь слегка подтолкнуть.",
        "description": ""
      },
      {
        "text": "―Ты будешь играть со мной еще одну каточку из-за совершенно неуместной уверенности в том что она последняя. А я буду играть потому, что с тобой безумно весело!\n―Я думаю, мы с тобой обречены играть в доту вечно.",
        "description": ""
      },
      {
        "text": "Такие как я... Люди вроде меня... Слушайте, я знаю, почему вы проводите свои \"занятия по групповой терапии\" при дневном свете. Я знаю, почему вы потом баттхертите что не сделали уроки. Дота. Дота показала ваше истинное лицо, к сожалению. Кастомхиро - это только начало. И что касается этого...  так сказать, плана по закрытию БИЧЕХОСТОВ\nУ БИЧЕХОСТОВ нет юрисдикции. Хост найдёт тебя и заманит на очередную катку. Я с одного взгляда вижу как ты согласишься...\n―Что ты предлагаешь?\n―Всё очень просто. Мы удалим Доту.",
        "description": ""
      },
      {
        "text": "―Да что ты хочешь?\n―Последнюю\n―Ты спятил\n―Нет, вовсе нет. Я не спятил. Если мы не сыграем последнюю, скоро малыш Хост не сможет купить даже косяк своей бабуле",
        "description": ""
      },
      {
        "text": "―О… Здравствуй, красавица! Ты, наверное, девушка из тиндера, хм? Ты и впрямь красивая... А чё ты нервничаешь? Из-за того что мне 28 лет? Сказать сколько я один? Иди сюда. Смотри на меня.\nУ меня была жена. Красивая... Как ты. Она говорила мне, что я слишком дединсайд, что мне нужно больше улыбаться и что-нибудь чувствовать! Она была игроком в доту, и крупно задолжала этим акулам… Из БИЧЕХОСТОВ... Однажды они предложили ей проиграть в доту вместе. У нее был очень низкий ММР, и её это убивало... Я лишь хотел, чтобы она снова улыбнулась... Я хотел, чтобы она знала, что мне плевать на эту игру... Поэтому, я зашел в приложения и компоненты — и сделал это. Я удалил доту. И знаешь что?\nОна не могла видеть меня! Она ушла... Теперь я вижу всю иронию...",
        "description": ""
      }
    ]
  }
]
