const tempMoments = [
    {
        "title": "Яблоки на мейне",
        "definition": "Вернуть говнолут пижаме",
        "history": "Когда мы залетели в Реддинг и убили пижаму по имени Антон, то обнаружили у него в инвентаре гору говнолута и в том числе более десятка яблок. Сжалившись над бедной пижамой, мы вернулись на мейн, выложили его лут и написали в нулевой: <div class=\"quote centered\">„Антон, яблоки на мейне“</div>"
    },
    {
        "title": "Толстяк с воды",
        "definition": "Неожиданное событие",
        "history": "Это произошло, когда БИЧЕХОСТЫ ещё только познавали мир Supreme Commander. Играя очередной Dual Gap, мы проморгали как на базу из реки вышел Толсяк."
    },
    {
        "title": "Гучигэнг",
        "definition": "SWAG убийство через модернизацию тактики Геттоганшип",
        "history": "Изначально Несс неправильно услышал слово \"Геттоганшип\" как \"Гучигэнг\", а потом Квир записал <a href=\"https://www.youtube.com/watch?v=9V1sd3MNFO0\">видео</a> с новой тактикой, где на Т3 транспорте прилетели Титаны"
    },
    {
        "title": "Можно разведку?",
        "definition": "Самый частый вопрос, который получает воздушный участник киберспортивной команды по Supreme Commander БИЧЕХОСТОВ",
        "history": "Несс играл на воздухе, но когда его просили разведку он не делал ¯\\_(ツ)_/¯"
    },
    {
        "title": "Фотография с сигаретой",
        "definition": "Если рядом Хост и Алер, значит пора сфотографироваться с сигаретами",
        "history": "Так исторически сложилось, что оба гунирала романтизируют маргинальный образ жизни. Это проявляется в любви к фотографиям с пивом на лавочке, с пивом без лавочки, с сигаретами, в грязных подъездах и так далее."
    },
    {
        "title": "kadikbamboe",
        "definition": "Засос в кадык, который получил Хост",
        "history": "После одного из первых Г-9, трое БИЧЕХОСТОВ вальяжно прогуливались по улице. Вдруг появилась нужда сделать фотографию с сигаретой. Посколько оба Гунирала не курят, пришлось искать у кого бы стрельнуть. Дело было на Плотинке, а на одной из скамеек культурно проводили время две дамы. Они обе были пьяные, и одна из них согласилась поделиться сигаретой \"услугой за услушу\". От Хоста потребовалось попозировать для фотографий, как будто он ухажёр это дамы, чтобы она отправила их бывшему мужу.<br>После того, как Гунирал пожертвовал собой и завоевал сигареты история не закончилась. Два гунирала приготовились позировать, а Квир снимать, как тут женщине пришла гениальная идея с фоткаться с нами. Она обвисла на Хосте и тут случилось два невероятных события:<ol><li>Женщина поцеловала Хоста в кадык, чуть не вырвав его</li><li>Её подруга сказала \"Да схвати ты за задницу!\". Никто никогда не узнает к кому она обращалась: к Алеру, недоуменно стоявщему рядом, Хосту или самой женщине, но действовать решил Егор</li></li></ol>"
    },
]

const tempTerms = [
    {
        "anchor": "bichehosti",
        "title": "БИЧЕХОСТЫ (устар. Бич-Хосты)",
        "definition": "Некоммерческая ПК организация.",
        "history": "Хотя можно считать БИЧЕХОСТОВ наследниками Нексуса, эти две организации существуют параллельно и официальная история организации началась 6 марта 2019 года. Изначально это было трое человек: Фанта, Хост и Алер. Они собирались для того чтобы поиграть в Фонлайн 20 сессию. Изначально все коммуникации производили во ВКонтакте и тройка получила название Ноулайферы. Однако в ВК говорить голосом нельзя, так что был взят старый сервер в Дискорде, получивший новое название \"Хайвеймены\" в честь славной сессии с бесконечными деньгами.   Вскоре помимо игр Ноулайферы стали видиться в реале и постепенно пожухли в Фонлайне. За это они получили новое название - Лайферы.<br>Расцвет БИЧЕХОСТОВ начался, когда они вернулись обратно в Фонлайн. Было принято решение о наращивании мощи БИЧЕХОСТОВ"
    },
    {
        "anchor": "rule",
        "title": "Закон БИЧЕХОСТОВ",
        "definition": "Суммарная сила БИЧЕХОСТОВ не зависит от количества человек в пачке и всегда равна константе. Другими словами - чем больше БИЧЕХОСТОВ, тем меньше их скилл",
        "history": "Этот эмпирический закон основан на золотом времени БИЧЕХОСТОВ, когда максимальный размер пачки составлял 6 человек. Именно тогда было замечено, что хоть БИЧЕХОСТОВ 2, хоть 6 - боевая эффективность не меняется"
    },
    {
        "anchor": "nivg",
        "title": "НИВГ",
        "definition": "Специальная форма номер 1 \"Не хочу играть в говно\". Форма заполняется в двух случаях:<ol><li>Добровольно, когда человек хочет перейти в разряд лайферов</li><li>В наказание за поведение недостойное звание БИЧЕХОСТА <a href=\"#besttrap\">(см. Ловушка лучшего)</a></ol>Форма представляет из себя фотографию хорошего качества, на которой виден человек, ее подающий, и особь женского пола, скрутившая губы в трубочку как для поцелуя. Каждую женщину можно использовать для фотографии только один раз. После заполнения формы Гуниралетет БИЧЕХОСТОВ рассмотрит заявку в течении трёх дней с момента подачи.",
        "history": "Во время становления БИЧЕХОСТОВ на 20 сессии была идея позвать играть Витяныча с нами. К сожалению маленький крымский мальчишка вырос в дерзкого школьника. На предложения поиграть он скинул фотографию со своей подружкой и написал: <p class=\"quote\">„Не. Хочу. Играть. В говно.“</p>После этого он удалил Хоста из друзей. С тех пор Витяныча нет с нами, а форма НИВГ осталась."
    },
    {
        "anchor": "g9",
        "title": "Г-9",
        "definition": "Вечерний сбор БИЧЕХОСТОВ в центре города в таких местах как Бичебар, КФЦ или плотника. Сопровождается курочкой/пивом/бесплатной едой и философским беседами",
        "history": "Одной из древнейших и важнейших традиий БИЧЕХОСТОВ начало было положено случайно. В один вечер Хост в шутку сказал Квиру, что они встречаются в Гринвиче в 9 часов. Квир приехал, а Хост нет. Такое непонимание произошло, потому что Квир не сказал \"Договорились\", а без этого любые разговоры считались пустой болтовней. В будущем это породило универсальный знак согласия <a href=\"#lifer\">(см Лайфер)</a>.<br>В итоге как только вечером Алер приехал с работы и узнал об этой ситуации, он вместе с Хостом решил приезхать к Гринвичу. В итоге встреча этих трёх людей и породила традицию. Кстати в тот день Квира развели мошенники по телефону."
    },
    {
        "anchor": "k9",
        "title": "К-9",
        "definition": "То же что и Г-9 только на кухне одного из БИЧЕХОСТОВ",
        "history": "Зачатки этого явления были ещё на заре БИЧЕХОСТОВ - тогда просто два, тогда еще не гунирала слива, собирались на Бичехате попить пива. Но это, со временем, сошло на нет. Так же спустя много времени был еденичный случай в ГУ с пиццей, магией и неворовством майонеза, но официально термин был принят, когда он полностью заменил Г-9 на посиделки в Гавани мужского Одиночества."
    },
    {
        "anchor": "89",
        "title": "8-9",
        "definition": "( ͡° ͜ʖ ͡°)",
        "history": ""
    },
    {
        "anchor": "jokertrap",
        "title": "Ловушка Джокера",
        "definition": "В узком смысле: пойти на Бот-лейн за Шако и Вейгара. В широком смысле: пойти на любой лайн с Хостом (пойти куда угодно с Хостом)",
        "history": "¯\\_(ツ)_/¯ Как-то раз Хост пошел на бот за Шако вместе с Вейгаром и понеслось... Хотя предтечи были заметны во время знаменитого дуэта \"Джакс и Жанна\""
    },
    {
        "anchor": "besttrap",
        "title": "Ловушка лучшего",
        "definition": "написать в канал \"бичехосты-лучшее\", думая что это \"дискуссии\"",
        "history": "Издревле презиралось, когда кто-то пишет в Лучшее, но название появилось, когда Паша написал с телефона реакцию на пост, не заметив что это лучшее"
    },
    {
        "anchor": "rpg",
        "title": "Лайфер, Дединсайд, ЧСВ",
        "definition": "Ролевая система БИЧЕХОСТОВ",
        "history": "<div class=\"centered small\">Лайфер<br>*<br>*&nbsp;&nbsp;&nbsp;*<br>*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;*</div>"
    },
    {
        "anchor": "lifer",
        "title": "Лайфер (знак согласия)",
        "definition": "Реакция смайлом :lifer:, означающая, что поставивший придет на мероприятие",
        "history": "Cмайл приешел на замену слова \"договорились\". Пиво отсылает к древним посиделкам БИЧЕХОСТОВ и Фонлайну, а название на желание выйти из дома.<div class=\"quote\">„Ставь :lifer: если идешь на Г-9 примерно в 18:30“</div>"
    }
]

function convertToHtml(term) {
    return `
    <section class="term-section centered">
        <a name=\"${term.anchor}\"></a>
        <div>
            <b>${term.title}</b> — ${term.definition}
        </div>
        <div class="history">
            <i>${term.history}</i>
        </div>
    </section>`
}

function loadFile(filePath) {
    let result = null;
    const xmlHttp = new XMLHttpRequest();
    xmlHttp.open("GET", filePath, false);
    xmlHttp.send();

    if (xmlHttp.status === 200) {
        result = xmlHttp.responseText;
    }

    return result;
}

function onLoad() {
    const result = [];
    terms = tempTerms
    for (const term of terms) {
        result.push(convertToHtml(term))
    }

    const content = document.getElementById("content");
    content.innerHTML = result.join("")

    const result2 = [];
    moments = tempMoments
    for (const moment of moments) {
        result2.push(convertToHtml(moment))
    }

    const content2 = document.getElementById("content2");
    content2.innerHTML = result2.join("")
}

window.onload = onLoad;